import {useState} from "react";

export default function Home() {
    return (
        <>
            <h1>Главная</h1>

            <p>
                Меня зовут Юрий.
                Я осознанно откликаюсь на вакансию React-разработчика и показываю практический результат <strong>до</strong> этапа собеседований.
            </p>

            <p>
                Мой основной профиль — backend / fullstack.
                В последнее время рынок по этому направлению просел,
                поэтому я целенаправленно переосвоил frontend-стек с упором на React.
            </p>

            <p>
                Чтобы это не выглядело «обучением ради обучения»,
                я собрал рабочий проект, приближённый к реальной задаче:
                авторизация, роли, CRUD, API, структура приложения.
            </p>

            <p>
                У меня большой коммерческий опыт разработки и ответственность за результат —
                поэтому React для меня не «новая игрушка», а ещё один рабочий инструмент.
            </p>

            <p>
                Я не позиционирую себя как senior React-разработчика.
                Моё предложение — честный уровень, системное мышление и способность быстро встраиваться в проект.
            </p>

            <p>
                Подробное резюме и подтверждение опыта — на следующей странице.
            </p>

        </>
    );
}
