import {useState} from "react";

export default function More_details() {
    return (
    <>
    <h1>Подробнее</h1>
        <p>Я в разработке с начала 90-х: сначала компилируемые продукты, позже коммерческая разработка под заказ.<br />
        Работал как в штате (в т.ч. удалённо), так и на фрилансе — с реальными заказчиками, ТЗ и ответственностью за результат.</p>
        <p>Один из подтверждённых этапов — работа в ООО «Чип» (2008 г.), откуда есть рекомендательное письмо.<br />
        Далее — фриланс и долгосрочные проекты, где вместо «писем» лучше всего говорят отзывы клиентов:</p>
        <ul>
        <li><a href="https://www.weblancer.net/users/SYuri/reviews/" target="_blank" >Weblancer</a></li>
        <li><a href="https://www.fl.ru/users/syuri/opinions/" target="_blank" >FL.ru</a></li>
        <li><a href="https://freelancehunt.com/freelancer/SYuri.html#reviews" target="_blank" >Freelancehunt</a></li>
        <li><a href="https://freelance.ru/reviews/SYuri/" target="_blank" >Freelance.ru</a></li>

        </ul>
        <p>Крайний проект <a href="https://vchaspik.ua" target="_blank" >vchaspik.ua</a> — пример
            того, как я использую Drupal именно как фреймворк, а не CMS.<br/>
            Около 95%
            логики находится «под капотом». При необходимости могу развернуть закрытую версию проекта и дать доступ для просмотра архитектуры и решений.</p>
        <p>React я начал изучать осознанно, понимая, что без практики это бессмысленно.<br />
            Поэтому текущий проект — это не учебный пример, а попытка максимально приблизиться к реальной рабочей задаче: авторизация, роли, CRUD, API, структура.</p>
        <p>Я не претендую на «готового сеньора React».<br />Я предлагаю честный уровень, инженерный подход и умение доводить задачи до результата.</p>
        </>
        );
}
